{
  "Education": [
    {
      "school": "Seattle University",
      "startDate": "2019-08-01",
      "endDate": "2021-03-01",
      "location": "Seattle, WA",
      "field": [
        "Computer Science"
      ],
      "degree": "Master of Science",
      "extra": [
        "Specializing in Software Engineering",
        "Outstanding Student Award Finalist: Computer Science"
      ]
    },
    {
      "school": "Seattle University",
      "startDate": "2018-06-01",
      "endDate": "2019-12-01",
      "location": "Seattle, WA",
      "field": [
        "Computer Science"
      ],
      "degree": "Graduate Certificate",
      "extra": [
        "The start of my career switch"
      ]
    },
    {
      "school": "Luther College",
      "startDate": "2012-08-01",
      "endDate": "2016-05-01",
      "location": "Decorah, IA",
      "field": [
        "Political Science",
        "Russian Studies"
      ],
      "degree": "Bachelor of Arts",
      "extra": [
        "NCAA Track & Field 2012-2016",
        "All-Conference Track & Field (Pole Vault) 2015 & 2016"
      ]
    }
  ],
  "Career": [
    {
      "startDate": "2021-08-01",
      "endDate": null,
      "location": "Remote",
      "jobTitle": "Software Developer",
      "employer": "Insurity",
      "description": [
        "Develop and maintain customer-facing products, using Java (Spring), TS (Angular), SQL, NoSQL, and Python.",
        "Interface directly with internal and external customers to proactively address product needs and resolve issues, fostering strong relationships and bolstering customer satisfaction through effective communication and tailored solutions.",
        "Drive cross-functional collaboration by facilitating seamless communication among diverse stakeholders, ensuring alignment with organizational objectives and driving timely completion of key project deliverables.",
        "Oversee bi-weekly production software pipeline process for major and minor product version deployments.",
        "Participate in daily standups, regular code reviews, and sprint planning, utilizing Agile methodologies."
      ]
    },
    {
      "startDate": "2020-08-01",
      "endDate": "2021-03-31",
      "location": "Seattle, WA",
      "jobTitle": "Software Engineer Consultant & Team Lead",
      "employer": "Puget Sound Energy",
      "description": [
        "Engineered automated financial reporting processes in Blue Prism using C# and Python, reducing processing time by 96%.",
        "Directed an Agile development team of four in regular standups, code reviews, and client meetings."
      ]
    },
    {
      "startDate": "2020-06-01",
      "endDate": "2021-03-31",
      "location": "Seattle, WA",
      "jobTitle": "Computer Science Graduate Teaching Assistant",
      "employer": "Seattle University",
      "description": [
        "Instructed 75+ graduate students in technical topics including algorithmic and procedural problem solving, Object-Oriented Programming, data structures, and software testing and debugging in Java and C++.",
        "Organized weekly office hours to provide tutoring, counseling, and academic assistance to students, leading to an average pass percentage of 93% across four courses."
      ]
    },
    {
      "startDate": "2019-10-01",
      "endDate": "2020-04-30",
      "location": "Seattle, WA",
      "jobTitle": "Web Developer",
      "employer": "Univera Serve First",
      "description": [
        "Redesigned and rebuilt fundraising website using JavaScript, HTML, and CSS improving site usability and reliability.",
        "Integrated Stripe payment processing to replace outdated services, reducing operating expenses.",
        "Led stakeholder meetings with Board, Marketing Team, and CEO to review changes and obtain sign off."
      ]
    },
    {
      "startDate": "2019-03-01",
      "endDate": "2019-08-31",
      "location": "Seattle, WA",
      "jobTitle": "Relations Analyst",
      "employer": "Tavour",
      "description": [
        "Collected and analyzed product performance using internal and market data to drive business strategy.",
        "Designed a product performance report system using Python and SQL that improved reporting time by 84%.",
        "Identified computing error and facilitated a solution that saved the company 10% on cost of every shipment.",
        "Automated inbound tracking process to provide process clarity and improve arrival time prediction by 15%."
      ]
    },
    {
      "startDate": "2017-02-01",
      "endDate": "2018-04-31",
      "location": "Seattle, WA",
      "jobTitle": "Technical Recruiter",
      "employer": "Amazon",
      "description": [
        "Created an applicant tracking tool using SQL and VBA to reduce candidate viability analysis time by 300%.",
        "Developed an Employee Referral tracking tool to improve visibility for recruiters and business stakeholders.",
        "Wrote queries in ATS recruiting software to identify viable candidates for specialized technical roles."
      ]
    }
  ]
}
