{
  "Languages": {
    "description": "",
    "icon": "",
    "skills": {
      "JavaScript": {
        "description": "Increasingly general-purpose programming language",
        "exp": {
          "years": 5,
          "notes": "JavaScript was the first language I learned when diving into web development. I've been using it professionally and in my various personal projects ever since."
        },
        "icon": {
          "name": "devicon-javascript-plain"
        }
      },
      "HTML": {
        "description": "HyperText Markup Language",
        "exp": {
          "years": 4,
          "notes": "I've learned HTML by doing and looking at a whole lot of page inspector."
        },
        "icon": {
          "name": "devicon-html5-plain-wordmark"
        }
      },
      "CSS": {
        "description": "Cascading Style Sheets",
        "exp": {
          "years": 4,
          "notes": "CSS is where the magic of design happens! Even though great tools exist that will style components for you, I think it's still important to know CSS."
        },
        "icon": {
          "name": "devicon-css3-plain-wordmark"
        }
      },
      "TypeScript": {
        "description": "Typed superset of JavaScript",
        "exp": {
          "years": 3,
          "notes": "TypeScript just feels like safer JavaScript. I'm used to typed languages so switching from JS to TS and back is easy."
        },
        "icon": {
          "name": "devicon-typescript-plain"
        }
      },
      "Python": {
        "description": "General-purpose programming language",
        "exp": {
          "years": 4,
          "notes": "Python feels like it's always there when I need it. Its simplicity and readability made learning to code a breeze, and I've been using it in a variety of ways from AI model engineering to scripting ever since."
        },
        "icon": {
          "name": "devicon-python-plain"
        }
      },
      "Java": {
        "description": "General-purpose programming language",
        "exp": {
          "years": 6,
          "notes": "Java holds a special place in my heart as it was the language I learned during my university days. It taught me the fundamentals of programming and problem-solving."
        },
        "icon": {
          "name": "devicon-java-plain"
        }
      },
      "C++": {
        "description": "General-purpose programming language",
        "exp": {
          "years": 2,
          "notes": "C++ was my first dive into lower-level programming, and it was a rollercoaster ride of challenges and triumphs. Building efficient algorithms in C++ was incredibly satisfying."
        },
        "icon": {
          "name": "devicon-cplusplus-plain"
        }
      },
      "C#": {
        "description": "General-purpose programming language",
        "exp": {
          "years": 2,
          "notes": "C# was the preferred language for many of my Professors in college. Most of them were former Microsoft, so it made sense."
        },
        "icon": {
          "name": "devicon-csharp-plain"
        }
      },
      "SQL": {
        "description": "Domain-specific language used to handle relational data.",
        "exp": {
          "years": 6,
          "notes": "Many flavors! SQL has been the backbone of many of my database projects during grad school and continues to be primary in my professional career. Its power and versatility in handling relational databases have been invaluable in creating efficient and scalable data solutions."
        },
        "icon": {
          "name": "devicon-azuresqldatabase-plain"
        }
      },
      "NoSQL": {
        "description": "Databases that store data in a format other than relational tables.",
        "exp": {
          "years": 4,
          "notes": "NoSQL databases have been a game-changer for me, especially in projects requiring flexible schema and scalability. Their document-based or key-value approach fits perfectly with modern application development."
        },
        "icon": {
          "name": "fa-solid fa-database"
        }
      },
      "Prolog": {
        "description": "Prolog is a logic programming language that has its origins in artificial intelligence, automated theorem proving and computational linguistics.",
        "exp": {
          "years": 1,
          "notes": "I used Prolog to program agent logic during research into ai development."
        },
        "icon": {
          "name": "devicon-prolog-plain"
        }
      }
    }
  },
  "Frontend": {
    "description": "Frontend technologies and frameworks",
    "skills": {
      "React": {
        "description": "React is a free and open-source front-end JavaScript library for building user interfaces based on UI components.",
        "exp": {
          "years": 3,
          "notes": "This website is built using React. React is one of my favorite ways to build apps and websites! The way components stack and interact with one another just makes sense to me."
        },
        "icon": {
          "name": "devicon-react-original"
        }
      },
      "Angular": {
        "description": "Angular is a platform for building mobile and desktop web applications.",
        "exp": {
          "years": 3,
          "notes": "Angular is pretty cool! Several of the projects I'm responsible for at Insurity use Angular, so I get to use it often."
        },
        "icon": {
          "name": "devicon-angular-plain"
        }
      },
      "NextJS": {
        "description": "Next.js is an open-source framework based on React that helps developers build web applications.",
        "exp": {
          "years": 1,
          "notes": "I'm relatively new to building with Next.js but I can already tell I'm going to like it."
        },
        "icon": {
          "name": "devicon-nextjs-plain"
        }
      }
    },
    "languages": [
      "JavaScript",
      "TypeScript",
      "HTML",
      "CSS",
      "XML"
    ],
    "icon": {
      "name": "fa-solid fa-display"
    }
  },
  "UI/UX": {
    "description": "User Interface and User Experience design technologies and frameworks",
    "skills": {
      "Bootstrap": {
        "description": "Bootstrap is a free and open-source CSS framework directed at responsive, mobile-first front-end web development.",
        "exp": {
          "years": 1,
          "notes": "Bootstrap has been convenient for rapidly prototyping user interfaces. Its extensive set of components and responsive design make UI development simple."
        },
        "icon": {
          "name": "devicon-bootstrap-plain"
        }
      },
      "Tailwind CSS": {
        "description": "Tailwind CSS is a design system implementation in pure CSS.",
        "exp": {
          "years": 1,
          "notes": "Tailwind has been easy to use and definitely speeds up my styling efforts. I really like that I can set components up to be responsive and interesting in such short order."
        },
        "icon": {
          "name": "devicon-tailwindcss-original"
        }
      },
      "SemanticUI": {
        "description": "Semantic is a development framework that helps create beautiful, responsive layouts using human-friendly HTML.",
        "exp": {
          "years": 4,
          "notes": "Semantic UI's intuitive syntax and modular approach have made UI design a pleasure for me. Its focus on readability and accessibility aligns perfectly with my design philosophy."
        },
        "icon": {
          "name": "fa-solid fa-code"
        }
      },
      "Figma": {
        "description": "Figma is a cloud-based design tool that is similar to Sketch in functionality and features, but with big differences that make Figma better for team collaboration.",
        "exp": {
          "years": 3,
          "notes": "Figma has become an indispensable tool in my design workflow. Its collaborative features and seamless integration with other tools have streamlined my design process."
        },
        "icon": {
          "name": "devicon-figma-plain"
        }
      },
      "WordPress": {
        "description": "WordPress is a free and open-source content management system written in PHP and paired with a MySQL or MariaDB database. Features include a plugin architecture and a template system, referred to within WordPress as Themes.",
        "exp": {
          "years": 1,
          "notes": "WordPress was my first foray into web design. Its simplicity allowed me to create basic websites in a short period of time."
        },
        "icon": {
          "name": "devicon-wordpress-plain"
        }
      }
    },
    "icon": {
      "name": "fa-solid fa-browser"
    }
  },
  "Mobile": {
    "description": "Mobile app development technologies.",
    "skills": {
      "React-Native": {
        "description": "React Native is a framework for building mobile applications using React.",
        "exp": {
          "years": 2,
          "notes": "Working with React Native has been a joy! It's amazing how I can leverage my React skills to develop mobile apps with such ease."
        },
        "icon": {
          "name": "devicon-react-original"
        }
      }
    },
    "languages": [
      "JavaScript",
      "HTML",
      "CSS"
    ],
    "icon": {
      "name": "fa-solid fa-mobile-screen-button"
    }
  },
  "Fullstack": {
    "description": "Fullstack development technologies and frameworks",
    "skills": {
      ".NET Core": {
        "description": ".NET Core is a framework for building web applications and services.",
        "exp": {
          "years": 2,
          "notes": "I've primarily used .NET Core in university. My professors liked this framework, so we used it a lot."
        },
        "icon": {
          "name": "devicon-dotnetcore-plain"
        }
      },
      "Spring": {
        "description": "The Spring Framework is an application framework for the Java platform.",
        "exp": {
          "years": 2,
          "notes": "Several of the projects I'm responsible for at Insurity use Spring, so I get to interact with it often."
        },
        "icon": {
          "name": "devicon-spring-original"
        }
      },
      "Redux": {
        "description": "Redux is a predictable state container for JavaScript apps.",
        "exp": {
          "years": 1,
          "notes": "Using Redux to manage state in my applications just feels right. It brought clarity and predictability to more complex of my frontend development workflows."
        },
        "icon": {
          "name": "devicon-redux-original"
        }
      }
    },
    "languages": [
      "JavaScript",
      "TypeScript",
      "Python"
    ],
    "icon": {
      "name": "fa-solid fa-pancakes"
    }
  },
  "Backend": {
    "description": "Backend technologies and frameworks",
    "skills": {
      "Node.js": {
        "description": "Node.js is an open-source, cross-platform JavaScript runtime environment that executes JavaScript code outside a web browser.",
        "exp": {
          "years": 4,
          "notes": "Node.js has been my go-to choice for backend development. Its event-driven architecture and extensive package ecosystem make building scalable servers a breeze."
        },
        "icon": {
          "name": "devicon-nodejs-plain"
        }
      },
      "nodewebkit": {
        "description": "Node.js is an open-source, cross-platform JavaScript runtime environment that executes JavaScript code outside a web browser.",
        "exp": {
          "years": 4,
          "notes": "Node.js has been my go-to choice for backend development. Its event-driven architecture and extensive package ecosystem make building scalable servers a breeze."
        },
        "icon": {
          "name": "devicon-nodewebkit-plain"
        }
      },
      "Express": {
        "description": "Express is a minimal and flexible Node.js web application framework.",
        "exp": {
          "years": 4,
          "notes": "Express is the backbone of many of my web projects. Its simplicity and robustness make it perfect for quickly spinning up RESTful APIs."
        },
        "icon": {
          "name": "devicon-express-original"
        }
      },
      "WildFly": {
        "description": "WildFly is a flexible, lightweight, managed application runtime that helps you build amazing applications.",
        "exp": {
          "years": 3,
          "notes": "I've mainly used WildFly in professional settings to quickly spin up local instances of Springs Apps."
        },
        "icon": {
          "name": "fa-solid fa-code"
        }
      },
      "Spring Boot": {
        "description": "Spring Boot is an open-source Java framework used for programming standalone, production-grade Spring-based applications with minimal effort.",
        "exp": {
          "years": 3,
          "notes": "We use Spring Boot in parts of our server-side framework at Insurity."
        },
        "icon": {
          "name": "devicon-spring-original"
        }
      }
    },
    "languages": [
      "Java",
      "C++",
      "C#",
      "Python"
    ],
    "icon": {
      "name": "fa-solid fa-server"
    }
  },
  "Data": {
    "description": "Data storage and management technologies",
    "skills": {
      "MongoDB": {
        "description": "MongoDB is a cross-platform document-oriented database program.",
        "exp": {
          "years": 4,
          "notes": "MongoDB has been my go-to database for projects requiring flexible schema and scalability. Its document-based approach fits perfectly with modern application development."
        },
        "icon": {
          "name": "devicon-mongodb-plain"
        }
      },
      "Azure Cosmos DB": {
        "description": "Azure Cosmos DB is a fully managed NoSQL database service for modern app development.",
        "exp": {
          "years": 1,
          "notes": "Azure Cosmos DB opened my eyes to the possibilities of NoSQL databases in building globally distributed, highly responsive applications. Its versatility is truly impressive."
        },
        "icon": {
          "name": "devicon-cosmosdb-plain"
        }
      },
      "DynamoDB": {
        "description": "Amazon Dynamo DB is a fully managed proprietary NoSQL database service that supports key-value and document data structures.",
        "exp": {
          "years": 3,
          "notes": "I use DynamoDB professionally. I've gotten really good at interacting with objects via api due to restrictions on GUI use."
        },
        "icon": {
          "name": "devicon-dynamodb-plain"
        }
      },
      "S3": {
        "description": "Amazon S3 is a scalable object storage service that allows you to store and retrieve any amount of data from anywhere on the web.",
        "exp": {
          "years": 3,
          "notes": "S3 has been my trusted companion for storing and serving static assets in web applications."
        },
        "icon": {
          "name": "devicon-amazonwebservices-plain-wordmark"
        }
      },
      "MySQL": {
        "description": "MySQL is an open-source relational database management system.",
        "exp": {
          "years": 3,
          "notes": "MySQL was my first introduction to relational databases and I still use it professionally."
        },
        "icon": {
          "name": "devicon-mysql-original"
        }
      },
      "PostgreSQL": {
        "description": "PostgreSQL is a powerful, open-source object-relational database system.",
        "exp": {
          "years": 1,
          "notes": "PostgreSQL's advanced features and extensibility have stood out for projects requiring complex data modeling and querying."
        },
        "icon": {
          "name": "devicon-postgresql-plain"
        }
      }
    },
    "languages": [
      "SQL",
      "NoSQL"
    ],
    "icon": {
      "name": "fa-solid fa-database"
    }
  },
  "Cloud": {
    "description": "Cloud computing platforms and services",
    "skills": {
      "AWS": {
        "description": "Amazon Web Services is a subsidiary of Amazon providing on-demand cloud computing platforms and APIs to individuals, companies, and governments, on a metered pay-as-you-go basis.",
        "exp": {
          "years": 4,
          "notes": "AWS was the first cloud platform I worked on. I've had the opportunity to work with a lot of solutions and feel very comfortable within the AWS ecosystem."
        },
        "icon": {
          "name": "devicon-amazonwebservices-plain-wordmark"
        }
      },
      "firebase": {
        "description": "Firebase is a cloud-based platform from Google that helps developers build, deploy, and scale apps for mobile and the web.",
        "exp": {
          "years": 4,
          "notes": "I use firebase to host all the services for my fullstack apps."
        },
        "icon": {
          "name": "devicon-firebase-plain"
        }
      },
      "Microsoft Azure": {
        "description": "Microsoft Azure, commonly referred to as Azure, is a cloud computing service created by Microsoft for building, testing, deploying, and managing applications and services through Microsoft-managed data centers.",
        "exp": {
          "years": 3,
          "notes": "Azure was the first cloud platform for which I set up a full CI/CD flow for an app I was working on at the time. Happy to say, the process was straight-forward enough!"
        },
        "icon": {
          "name": "devicon-azuredevops-plain"
        }
      },
      "Google Cloud Platform": {
        "description": "Google Cloud Platform is a suite of cloud computing services that runs on the same infrastructure that Google uses internally for its end-user products, such as Google Search, Gmail, file storage, and YouTube.",
        "exp": {
          "years": 2,
          "notes": "Google Cloud Platform's innovation and reliability have impressed me time and again. From AI and machine learning to scalable infrastructure, GCP has everything I need to build cutting-edge applications."
        },
        "icon": {
          "name": "devicon-googlecloud-plain"
        }
      },
      "Docker": {
        "description": "Docker is a set of platform as a service products that use OS-level virtualization to deliver software in packages called containers.",
        "exp": {
          "years": 1,
          "notes": "Docker revolutionized my development workflow by streamlining the deployment process. Its lightweight containers and portability have made shipping applications a breeze."
        },
        "icon": {
          "name": "devicon-docker-plain"
        }
      }
    },
    "icon": {
      "name": "fa-solid fa-cloud"
    }
  },
  "Machine Learning & AI": {
    "description": "Machine learning and artificial intelligence technologies and frameworks",
    "icon": {
      "name": "fa-solid fa-brain-circuit"
    },
    "languages": [
      "Python",
      "Prolog"
    ],
    "skills": {
      "Pandas": {
        "description": "Pandas is a powerful and flexible open-source data manipulation and analysis library for Python, providing data structures like DataFrame and Series for easy handling of structured data.",
        "exp": {
          "years": 3,
          "notes": "I've used Pandas extensively for cleaning, transforming, and analyzing large datasets. Its user-friendly API and rich functionality simplify complex data operations."
        },
        "icon": {
          "name": "devicon-pandas-plain"
        }
      },
      "Numpy": {
        "description": "NumPy is the core library for numerical computing in Python, offering support for large multi-dimensional arrays and matrices, along with a collection of mathematical functions to operate on them.",
        "exp": {
          "years": 3,
          "notes": "NumPy has been a cornerstone in my data processing tasks, enabling efficient numerical calculations and seamless integration with other scientific libraries."
        },
        "icon": {
          "name": "devicon-numpy-plain"
        }
      },
      "TensorFlow": {
        "description": "TensorFlow is a comprehensive open-source platform for machine learning, providing tools for building, training, and deploying machine learning models at scale.",
        "exp": {
          "years": 2,
          "notes": "TensorFlow is great for developing deep learning models. Its robustness and extensive ecosystem make it ideal for both research and production applications."
        },
        "icon": {
          "name": "devicon-tensorflow-original"
        }
      },
      "PyTorch": {
        "description": "PyTorch is a popular open-source machine learning library based on Torch, known for its dynamic computation graph and ease of use, particularly in deep learning applications.",
        "exp": {
          "years": 2,
          "notes": "PyTorch has transformed my approach to deep learning with its dynamic nature and intuitive design. It has been particularly beneficial for rapid prototyping and research experimentation."
        },
        "icon": {
          "name": "devicon-pytorch-original"
        }
      },
      "Scikit-learn": {
        "description": "Scikit-learn is a versatile machine learning library for Python, offering simple and efficient tools for data mining and data analysis, built on NumPy, SciPy, and matplotlib.",
        "exp": {
          "years": 3,
          "notes": "Scikit-learn has been indispensable for my classical machine learning projects. Its comprehensive suite of algorithms and tools for model selection, validation, and preprocessing streamline the development process."
        },
        "icon": {
          "name": "devicon-scikitlearn-plain"
        }
      },
      "Model Engineering": {
        "description": "Model engineering involves the design, development, and optimization of machine learning models to solve specific problems effectively and efficiently.",
        "exp": {
          "years": 1,
          "notes": "My experience in model engineering includes designing robust architectures, optimizing hyperparameters, and ensuring models meet performance and accuracy requirements."
        },
        "icon": {
          "name": "fa-solid fa-code-branch"
        }
      },
      "Model Validation": {
        "description": "Model validation is the process of evaluating machine learning models to ensure they generalize well to new, unseen data and meet the desired performance criteria.",
        "exp": {
          "years": 1,
          "notes": "I have applied various validation techniques, such as cross-validation and A/B testing, to rigorously assess model performance and prevent overfitting."
        },
        "icon": {
          "name": "fa-solid fa-list-check"
        }
      },
      "Model Training": {
        "description": "Model training is the process of teaching a machine learning model to recognize patterns in data by adjusting its parameters based on a training dataset.",
        "exp": {
          "years": 1,
          "notes": "I have trained numerous models, leveraging techniques like gradient descent and regularization to optimize performance and ensure convergence."
        },
        "icon": {
          "name": "fa-solid fa-brain"
        }
      }
    }
  },
  "Scripting": {
    "description": "Scripting languages and automation tools",
    "icon": {
      "name": "fa-solid fa-brain-circuit"
    },
    "skills": {
      "Batch": {
        "description": "Batch scripting is a way of automating tasks in Windows.",
        "exp": {
          "years": 4,
          "notes": "Batch scripting saved me countless hours of repetitive tasks on Windows. From file management to system maintenance, batch scripts have been my reliable assistant."
        },
        "icon": {
          "name": "fa-brands fa-windows"
        }
      },
      "Shell": {
        "description": "Shell scripting is a way of automating tasks in Unix-like operating systems.",
        "exp": {
          "years": 4,
          "notes": "I prefer writing scripts in shell and I think Linux commands make more sense."
        },
        "icon": {
          "name": "devicon-bash-plain"
        }
      }
    }
  },
  "Testing and Automation": {
    "description": "Testing and automation frameworks and tools",
    "skills": {
      "JUnit": {
        "description": "JUnit is a unit testing framework for the Java programming language.",
        "exp": {
          "years": 5,
          "notes": "JUnit was my first and still is the primary framework I use for unit testing in Java. Its simplicity and extensive documentation make writing and running tests a breeze."
        },
        "icon": {
          "name": "devicon-junit-plain"
        }
      },
      "Mocha": {
        "description": "Mocha is a feature-rich JavaScript test framework running on Node.js and in the browser, making asynchronous testing simple and fun.",
        "exp": {
          "years": 1,
          "notes": "I've used Mocha extensively for testing JavaScript applications. Its support for asynchronous testing and flexible assertions make it a joy to work with."
        },
        "icon": {
          "name": "devicon-mocha-plain"
        }
      },
      "Selenium": {
        "description": "Selenium is a portable framework for testing web applications.",
        "exp": {
          "years": 1,
          "notes": "Selenium has been instrumental in ensuring the quality of my web applications. Its cross-browser testing capabilities have saved me from many compatibility headaches."
        },
        "icon": {
          "name": "devicon-selenium-original"
        }
      },
      "Jest": {
        "description": "Jest is a delightful JavaScript Testing Framework with a focus on simplicity.",
        "exp": {
          "years": 2,
          "notes": "Jest has made testing JavaScript applications a breeze with its intuitive API and built-in mocking capabilities."
        },
        "icon": {
          "name": "devicon-jest-plain"
        }
      },
      "BluePrism": {
        "description": "Blue Prism is a set of tools, libraries, and runtime environments for RPA (Robotic Process Automation).",
        "exp": {
          "years": 1,
          "notes": "I've used Blue Prism professionally to automate repetitive financial tasks for the customers."
        },
        "icon": {
          "name": "fa-solid fa-code"
        }
      },
      "Mockito": {
        "description": "Mockito is an open-source testing framework for Java released under the MIT License.",
        "exp": {
          "years": 1,
          "notes": "Mockito has been invaluable in my Java projects for creating mock objects and verifying interactions between components."
        },
        "icon": {
          "name": "fa-solid fa-code"
        }
      }
    },
    "icon": {
      "name": "fa-solid fa-robot"
    }
  }
}


