{
  "Languages": {
    "JavaScript": {
      "description": "Increasingly general-purpose programming language",
      "exp": {
        "years": 5,
        "notes": "JavaScript was the first language I learned when diving into web development. I still remember the excitement of seeing my first interactive webpage come to life!"
      },
      "icon": {
        "name": "fa-brands fa-js"
      }
    },
    "HTML": {
      "description": "HyperText Markup Language",
      "exp": {
        "years": 4,
        "notes": "HTML was like my gateway into the world of coding. Creating my first webpage with HTML felt like unlocking a new realm of creativity."
      },
      "icon": {
        "name": "fa-brands fa-html5"
      }
    },
    "CSS": {
      "description": "Cascading Style Sheets",
      "exp": {
        "years": 4,
        "notes": "CSS is where the magic of design happens! I remember the first time I styled a webpage and saw how CSS transformed its appearance."
      },
      "icon": {
        "name": "fa-brands fa-css3-alt"
      }
    },
    "XML": {
      "description": "eXtensible Markup Language",
      "exp": {
        "years": 3,
        "notes": "XML was crucial for structuring data in one of my early projects. It made handling complex data sets feel manageable and organized."
      },
      "icon": {
        "name": "fa-solid fa-code"
      }
    },
    "TypeScript": {
      "description": "Typed superset of JavaScript",
      "exp": {
        "years": 3,
        "notes": "TypeScript has been a game-changer for me, especially in larger projects where type safety is essential. It helped catch bugs early and improved my code quality."
      },
      "icon": {
        "name": "fa-solid fa-code"
      }
    },
    "Python": {
      "description": "General-purpose programming language",
      "exp": {
        "years": 4,
        "notes": "Python was my first love in programming. Its simplicity and readability made learning to code a breeze, and I've been hooked ever since."
      },
      "icon": {
        "name": "fa-brands fa-python"
      }
    },
    "Java": {
      "description": "General-purpose programming language",
      "exp": {
        "years": 6,
        "notes": "Java holds a special place in my heart as it was the language I learned during my university days. It taught me the fundamentals of programming and problem-solving."
      },
      "icon": {
        "name": "fa-brands fa-java"
      }
    },
    "C++": {
      "description": "General-purpose programming language",
      "exp": {
        "years": 2,
        "notes": "C++ was my first dive into lower-level programming, and it was a rollercoaster ride of challenges and triumphs. Building efficient algorithms in C++ was incredibly satisfying."
      },
      "icon": {
        "name": "fa-solid fa-code"
      }
    },
    "C#": {
      "description": "General-purpose programming language",
      "exp": {
        "years": 2,
        "notes": "C# was the language I used to develop my first game. The experience was exhilarating, and it opened my eyes to the world of game development."
      },
      "icon": {
        "name": "fa-solid fa-code"
      }
    }
  },
  "Frontend": {
    "description": "Frontend technologies and frameworks",
    "frameworks": {
      "React": {
        "description": "React is a free and open-source front-end JavaScript library for building user interfaces based on UI components.",
        "exp": {
          "years": 3,
          "notes": "React is one of my favorite ways to build apps and websites! The way components stack and interact with one another just makes sense to me."
        },
        "icon": {
          "name": "fa-brands fa-react"
        }
      },
      "Angular": {
        "description": "Angular is a platform for building mobile and desktop web applications.",
        "exp": {
          "years": 1,
          "notes": "Angular is pretty cool! One of the projects I'm responsible for at Insurity uses Angular, so I get to use it often."
        },
        "icon": {
          "name": "fa-brands fa-angular"
        }
      }
    },
    "languages": [
      "JavaScript",
      "TypeScript",
      "HTML",
      "CSS",
      "XML"
    ],
    "icon": {
      "name": "fa-solid fa-display"
    }
  },
  "Mobile": {
    "description": "Mobile app development technologies.",
    "frameworks": {
      "React-Native": {
        "description": "React Native is a framework for building mobile applications using React.",
        "exp": {
          "years": 2,
          "notes": "Working with React Native has been a joy! It's amazing how I can leverage my React skills to develop mobile apps with such ease."
        },
        "icon": {
          "name": "fa-brands fa-react"
        }
      }
    },
    "icon": {
      "name": "fa-solid fa-mobile-screen-button"
    }
  },
  "Fullstack": {
    "description": "Fullstack development technologies and frameworks",
    "frameworks": {
      ".NET": {
        "description": ".NET is a framework for building web applications and services.",
        "exp": {
          "years": 2,
          "notes": "I've been exploring .NET for a while now, and I'm impressed by its versatility and the extensive tooling it offers for fullstack development."
        },
        "icon": {
          "name": "fa-solid fa-code"
        }
      },
      "Redux": {
        "description": "Redux is a predictable state container for JavaScript apps.",
        "exp": {
          "years": 1,
          "notes": "Using Redux revolutionized the way I manage state in my applications. It brought clarity and predictability to my frontend development workflow."
        },
        "icon": {
          "name": "fa-solid fa-code"
        }
      }
    },
    "languages": [
      "JavaScript",
      "TypeScript",
      "Python"
    ],
    "icon": {
      "name": "fa-solid fa-pancakes"
    }
  },
  "Backend": {
    "description": "Backend technologies and frameworks",
    "frameworks": {
      "Node.js": {
        "description": "Node.js is an open-source, cross-platform JavaScript runtime environment that executes JavaScript code outside a web browser.",
        "exp": {
          "years": 4,
          "notes": "Node.js has been my go-to choice for backend development. Its event-driven architecture and extensive package ecosystem make building scalable servers a breeze."
        },
        "icon": {
          "name": "fa-brands fa-node-js"
        }
      },
      "Express": {
        "description": "Express is a minimal and flexible Node.js web application framework.",
        "exp": {
          "years": 4,
          "notes": "Express has been the backbone of many of my web projects. Its simplicity and robustness make it perfect for quickly spinning up RESTful APIs."
        },
        "icon": {
          "name": "fa-solid fa-code"
        }
      },
      "WildFly": {
        "description": "WildFly is a flexible, lightweight, managed application runtime that helps you build amazing applications.",
        "exp": {
          "years": 3,
          "notes": "WildFly introduced me to the world of JavaEE and enterprise-level application development. Its lightweight nature and powerful features make it a joy to work with."
        },
        "icon": {
          "name": "fa-solid fa-code"
        }
      }
    },
    "languages": [
      "Java",
      "C++",
      "C#",
      "Python"
    ],
    "icon": {
      "name": "fa-solid fa-server"
    }
  },
  "Data": {
    "description": "Data storage and management technologies",
    "frameworks": {
      "MongoDB": {
        "description": "MongoDB is a cross-platform document-oriented database program.",
        "exp": {
          "years": 4,
          "notes": "MongoDB has been my go-to database for projects requiring flexible schema and scalability. Its document-based approach fits perfectly with modern application development."
        },
        "icon": {
          "name": "fa-solid fa-code"
        }
      },
      "Azure Cosmos DB": {
        "description": "Azure Cosmos DB is a fully managed NoSQL database service for modern app development.",
        "exp": {
          "years": 1,
          "notes": "Azure Cosmos DB opened my eyes to the possibilities of NoSQL databases in building globally distributed, highly responsive applications. Its versatility is truly impressive."
        },
        "icon": {
          "name": "fa-solid fa-code"
        }
      },
      "DynamoDB": {
        "description": "Amazon Dynamo DB is a fully managed proprietary NoSQL database service that supports key-value and document data structures.",
        "exp": {
          "years": 3,
          "notes": "DynamoDB has been instrumental in handling massive amounts of data in my projects. Its scalability and performance make it a top choice for high-traffic applications."
        },
        "icon": {
          "name": "fa-solid fa-code"
        }
      },
      "S3": {
        "description": "Amazon S3 is a scalable object storage service that allows you to store and retrieve any amount of data from anywhere on the web.",
        "exp": {
          "years": 3,
          "notes": "S3 has been my trusted companion for storing and serving static assets in web applications. Its reliability and scalability are unmatched."
        },
        "icon": {
          "name": "fa-solid fa-code"
        }
      },
      "MySQL": {
        "description": "MySQL is an open-source relational database management system.",
        "exp": {
          "years": 3,
          "notes": "MySQL was my first introduction to relational databases. Its ease of use and widespread adoption made it the perfect choice for many of my early projects."
        },
        "icon": {
          "name": "fa-solid fa-code"
        }
      },
      "PostgreSQL": {
        "description": "PostgreSQL is a powerful, open-source object-relational database system.",
        "exp": {
          "years": 1,
          "notes": "PostgreSQL's advanced features and extensibility have made it my go-to choice for projects requiring complex data modeling and querying."
        },
        "icon": {
          "name": "fa-solid fa-code"
        }
      },
      "SQL Server": {
        "description": "Microsoft SQL Server is a relational database management system developed by Microsoft.",
        "exp": {
          "years": 1,
          "notes": "SQL Server has been crucial for integrating with Microsoft technologies in my projects. Its robustness and enterprise-level features make it a solid choice for mission-critical applications."
        },
        "icon": {
          "name": "fa-solid fa-code"
        }
      },
      "Redshift": {
        "description": "Amazon Redshift is a fully managed, petabyte-scale data warehouse service in the cloud.",
        "exp": {
          "years": 1,
          "notes": "Redshift has been a game-changer for me in handling big data analytics. Its scalability and performance have enabled me to derive valuable insights from large datasets efficiently."
        },
        "icon": {
          "name": "fa-solid fa-code"
        }
      }
    },
    "languages": [
      "SQL",
      "NoSQL"
    ],
    "icon": {
      "name": "fa-solid fa-database"
    }
  },
  "UI/UX": {
    "description": "User Interface and User Experience design technologies and frameworks",
    "frameworks": {
      "Bootstrap": {
        "description": "Bootstrap is a free and open-source CSS framework directed at responsive, mobile-first front-end web development.",
        "exp": {
          "years": 1,
          "notes": "Bootstrap has been my go-to choice for rapidly prototyping user interfaces. Its extensive set of components and responsive design make UI development a breeze."
        },
        "icon": {
          "name": "fa-solid fa-code"
        }
      },
      "SemanticUI": {
        "description": "Semantic is a development framework that helps create beautiful, responsive layouts using human-friendly HTML.",
        "exp": {
          "years": 4,
          "notes": "Semantic UI's intuitive syntax and modular approach have made UI design a pleasure for me. Its focus on readability and accessibility aligns perfectly with my design philosophy."
        },
        "icon": {
          "name": "fa-solid fa-code"
        }
      },
      "Material Design": {
        "description": "Material Design is a design language developed by Google in 2014.",
        "exp": {
          "years": 2,
          "notes": "Material Design's principles of motion and depth have transformed the way I approach UI design. Its emphasis on real-world interactions creates immersive experiences that users love."
        },
        "icon": {
          "name": "fa-solid fa-code"
        }
      },
      "Figma": {
        "description": "Figma is a cloud-based design tool that is similar to Sketch in functionality and features, but with big differences that make Figma better for team collaboration.",
        "exp": {
          "years": 3,
          "notes": "Figma has become an indispensable tool in my design workflow. Its collaborative features and seamless integration with other tools have streamlined my design process."
        },
        "icon": {
          "name": "fa-brands fa-figma"
        }
      },
      "WordPress": {
        "description": "WordPress is a free and open-source content management system written in PHP and paired with a MySQL or MariaDB database. Features include a plugin architecture and a template system, referred to within WordPress as Themes.",
        "exp": {
          "years": 1,
          "notes": "WordPress was my first foray into web design. Its simplicity and extensibility allowed me to create stunning websites in a short period of time."
        },
        "icon": {
          "name": "fa-brands fa-wordpress"
        }
      }
    },
    "icon": {
      "name": "fa-solid fa-browser"
    }
  },
  "Cloud": {
    "description": "Cloud computing platforms and services",
    "frameworks": {
      "AWS": {
        "description": "Amazon Web Services is a subsidiary of Amazon providing on-demand cloud computing platforms and APIs to individuals, companies, and governments, on a metered pay-as-you-go basis.",
        "exp": {
          "years": 4,
          "notes": "AWS has been my go-to cloud platform for deploying scalable and reliable applications. Its vast array of services and global infrastructure make it unbeatable for cloud computing."
        },
        "icon": {
          "name": "fa-brands fa-aws"
        }
      },
      "Microsoft Azure": {
        "description": "Microsoft Azure, commonly referred to as Azure, is a cloud computing service created by Microsoft for building, testing, deploying, and managing applications and services through Microsoft-managed data centers.",
        "exp": {
          "years": 3,
          "notes": "Azure has been instrumental in bridging the gap between on-premises and cloud environments in my projects. Its seamless integration with Microsoft technologies makes it a natural choice for enterprise applications."
        },
        "icon": {
          "name": "fa-brands fa-microsoft"
        }
      },
      "Google Cloud Platform": {
        "description": "Google Cloud Platform is a suite of cloud computing services that runs on the same infrastructure that Google uses internally for its end-user products, such as Google Search, Gmail, file storage, and YouTube.",
        "exp": {
          "years": 2,
          "notes": "Google Cloud Platform's innovation and reliability have impressed me time and again. From AI and machine learning to scalable infrastructure, GCP has everything I need to build cutting-edge applications."
        },
        "icon": {
          "name": "fa-brands fa-google"
        }
      },
      "Docker": {
        "description": "Docker is a set of platform as a service products that use OS-level virtualization to deliver software in packages called containers.",
        "exp": {
          "years": 1,
          "notes": "Docker revolutionized my development workflow by streamlining the deployment process. Its lightweight containers and portability have made shipping applications a breeze."
        },
        "icon": {
          "name": "fa-brands fa-docker"
        }
      }
    },
    "icon": {
      "name": "fa-solid fa-cloud"
    }
  },
  "Machine Learning & AI": {
    "description": "Machine learning and artificial intelligence technologies and frameworks",
    "icon": {
      "name": "fa-solid fa-brain-circuit"
    }
  },
  "Scripting": {
    "description": "Scripting languages and automation tools",
    "Windows": {
      "description": "Scripting on Windows operating system",
      "Batch Scripting": {
        "description": "Batch scripting is a way of automating tasks in Windows.",
        "exp": {
          "years": 4,
          "notes": "Batch scripting saved me countless hours of repetitive tasks on Windows. From file management to system maintenance, batch scripts have been my reliable assistant."
        },
        "icon": {
          "name": "fa-brands fa-windows"
        }
      }
    },
    "Linux": {
      "description": "Scripting on Linux operating system",
      "Shell Scripting": {
        "description": "Shell scripting is a way of automating tasks in Unix-like operating systems.",
        "exp": {
          "years": 4,
          "notes": "Shell scripting has been my Swiss army knife in Linux. Whether it's system administration or process automation, shell scripts have been my trusty companion."
        },
        "icon": {
          "name": "fa-brands fa-linux"
        }
      }
    },
    "general": {
      "description": "General-purpose scripting language",
      "languages": [
        "Python"
      ],
      "icon": {
        "name": "fa-solid fa-scroll"
      }
    },
    "Testing and Automation": {
      "description": "Testing and automation frameworks and tools",
      "frameworks": {
        "JUnit": {
          "description": "JUnit is a unit testing framework for the Java programming language.",
          "exp": {
            "years": 5,
            "notes": "JUnit was my first and still has been my go-to framework for unit testing in Java. Its simplicity and extensive documentation make writing and running tests a breeze."
          },
          "icon": {
            "name": "fa-solid fa-code"
          }
        },
        "Mocha": {
          "description": "Mocha is a feature-rich JavaScript test framework running on Node.js and in the browser, making asynchronous testing simple and fun.",
          "exp": {
            "years": 1,
            "notes": "Mocha has been my preferred choice for testing JavaScript applications. Its support for asynchronous testing and flexible assertions make it a joy to work with."
          },
          "icon": {
            "name": "fa-solid fa-code"
          }
        },
        "Selenium": {
          "description": "Selenium is a portable framework for testing web applications.",
          "exp": {
            "years": 1,
            "notes": "Selenium has been instrumental in ensuring the quality of my web applications. Its cross-browser testing capabilities have saved me from many compatibility headaches."
          },
          "icon": {
            "name": "fa-solid fa-code"
          }
        },
        "Jest": {
          "description": "Jest is a delightful JavaScript Testing Framework with a focus on simplicity.",
          "exp": {
            "years": 2,
            "notes": "Jest has made testing JavaScript applications a breeze with its intuitive API and built-in mocking capabilities. It's my go-to choice for frontend testing."
          },
          "icon": {
            "name": "fa-solid fa-code"
          }
        },
        "BluePrism": {
          "description": "Blue Prism is a set of tools, libraries, and runtime environments for RPA (Robotic Process Automation).",
          "exp": {
            "years": 1,
            "notes": "Blue Prism has opened up new possibilities for automating repetitive tasks in my workflow. Its drag-and-drop interface makes building automation processes a breeze."
          },
          "icon": {
            "name": "fa-solid fa-code"
          }
        },
        "Mockito": {
          "description": "Mockito is an open-source testing framework for Java released under the MIT License.",
          "exp": {
            "years": 1,
            "notes": "Mockito has been invaluable in my Java projects for creating mock objects and verifying interactions between components. Its simplicity and flexibility make testing a pleasure."
          },
          "icon": {
            "name": "fa-solid fa-code"
          }
        },
        "Apache JMeter": {
          "description": "Apache JMeter is an Apache project that can be used as a load testing tool for analyzing and measuring the performance of a variety of services.",
          "exp": {
            "years": 1,
            "notes": "Apache JMeter has been my go-to tool for load testing web applications. Its extensibility and rich feature set make it a powerful tool for performance testing."
          },
          "icon": {
            "name": "fa-solid fa-code"
          }
        }
      },
      "icon": {
        "name": "fa-solid fa-robot"
      }
    }
  }
}
